Repository: RisingStar-Web/ipCalculator
Catalog: calculator2/*.lproj/Localizable.strings
Languages: ru

# ConvertTo10
source: Let's convert %@ from %d to 10 number system: (
ru: Переведем %@ из %d в 10 систему счисления: (

# ConvertFrom10
source: Let's convert %f from 10 to %d number system:
ru: Переведем %@ из 10 в %d систему счисления:

# ConvertFrom10int
source: Let's convert %d from 10 to %d number system:
ru: Переведем %@ из 10 в %d систему счисления:

# WriteFromTheEnd
source: Now write last result and reminders backwords: %@
ru: Записываем последнее частное и остатки в обратном порядке: %@

# ErrorFrom2to64
source: Error, only systems from 2 to 64
ru: Ошибка, поддерживаются системы счисления от 2 до 64

# NotThatSystem
source: It is not a valid number in selected number system
ru: Введено число, не соответствующее выбранной системе счисления

source: Answer: %@
ru: Ответ: %@

# AOST
source: %d reminder %d
ru: %d остаток %d

# celayaChast
source: Let's convert the whole number:
ru: Переведем целую часть числа:

# PerevedemDrobnuyChacst
source: Let's convert the fractional part:
ru: Переведем дробную часть числа с точностью до 8 знаков:

# ZapishemCeluyChast
source: Now write integer parts of results from the top down %@
ru: Запишем целые части произведений сверху вниз: %@

# Skompanuem
source: Append fractional to integer part: %@.%@
ru: Скомпануем результат перевода целой части и дробной: %@.%@
